Jianmufen/xiaoqihou2/程序/STM32Cube_FW_L1_V1.6.0/Projects/NMDT30_BOARD_MTH/Applications/FreeRTOS/FreeRTOS_ThreadCreation/Inc/sensor_def.h
/**
  ******************************************************************************
  * File Name          : sensor_def.h
  * Description        : This file provides sensor definitions. 
  * 
  ******************************************************************************
  *
  * COPYRIGHT(c) 2015 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __SENSOR_DEF_H
#define __SENSOR_DEF_H
#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l1xx_hal.h"
#include "sensor_conf.h"

   
/* Exported types ------------------------------------------------------------*/
   
/**
  * @}
  */

/**
  * @}
  */

/** 
  * @brief  Quality control Structure
  */
typedef struct
{
  uint16_t  StorageFlag;    /* flag that indicates if the data has been stored in NV storage */
  int16_t   UpperLimit;     /* sample data upper limit */
  int16_t   LowerLimit;     /* sample data lower limit */
  int16_t   MaxChangeRate;  /* sample data maximum change rate */
} QualityControlTypeDef;
   
/** 
  * @brief Quadratic Correction Coefficient
  */
typedef struct
{
  uint16_t  StorageFlag;    /* flag that indicates if the data has been stored in NV storage */
  float   A;               /* Quadratic Coefficients */
  float   B;               /* Monomial coefficient */
  float   C;               /* Constant coefficient */
} QuadraticCorrectionTypeDef;

/** 
  * @brief Standard deviation calculate time interval
  */
typedef struct
{
  uint16_t  StorageFlag;    /* flag that indicates if the data has been stored in NV storage */
  int16_t   TimeInterval;   /* time interval */
} StdevTimeIntervalTypeDef;

/** 
  * @brief  Correction Table Structure
  */
typedef struct
{
  uint16_t  StorageFlag;    /* flag that indicates if the data has been stored in NV storage */
  float    table[MAX_CT_NUMBER];      /* table saving correction value */
} CorrectionTableTypeDef;


/** 
  * @brief  Extremum Value Structure
  */
typedef struct
{
  int16_t value;
  struct
  {
    uint8_t hour;
    uint8_t minute;
    uint8_t second;
  } time;
} ExtremunValueTypeDef;


/** 
  * @brief  Radiation Sensitivity Coefficient Structure
  */
typedef struct
{
  uint16_t  StorageFlag;    /* flag that indicates if the data has been stored in NV storage */
  float     coefficient;    /* coefficient */
} RadiationCoefficientTypeDef;

/** 
  * @brief Data output time interval
  */
typedef struct
{
  uint16_t  StorageFlag;    /* flag that indicates if the data has been stored in NV storage */
  int16_t   TimeInterval;   /* time interval */
} DataOutputTimeIntervalTypeDef;

/**
  * @}
  */

/* Output Data */

/** 
  * @brief  Temperature Data Structure
  */  
typedef struct 
{
  int16_t t_1min;   /* 1 minute average temperature */
  /* max and min */
  ExtremunValueTypeDef max;
  ExtremunValueTypeDef min;
  
} TemperatureDataTypeDef;


/** 
  * @brief  Humidity Data Structure
  */  
typedef struct 
{
  int16_t h_1min;   /* 1 minute average humidity */
  ExtremunValueTypeDef min;  /* min humidity */
  
} HumidityDataTypeDef;

/** 
  * @brief  Radiation Data Structure
  */  
typedef struct 
{
  int16_t r_1min;   /* 1 minute average radiation */
  ExtremunValueTypeDef max;  /* max radiation */
  
  int32_t r_sum_hour;        /* Accumulated duration of radiation in 1 hour */
  int32_t r_sum_day;         /* Accumulated duration of radiation in 1 day */
  
  
} RadiationDataTypeDef;
  
/** 
  * @brief  Soil Moisture Data Structure
  */  
typedef struct 
{
  int16_t sm_1min;   /* 1 minute soil moisture */
  
  int16_t sm_voltage_10min;  /* 10 minutes average voltage , unit : mv */
  int16_t sm_voltage_1hour;  /* 1  hour    average voltage , unit : mv */
  
} SoilMoistureDataTypeDef;

/** 
  * @brief  Wind Speed Data Structure
  */  
typedef struct 
{
  int16_t ws_3s;     /* instantaneous wind speed : 3s average value  */
  int16_t ws_1min;   /* 1 minute average wind speed */
  int16_t ws_2min;   /* 2 minutes average wind speed */
  int16_t ws_10min;  /* 10 minutes average wind speed */

  ExtremunValueTypeDef max;    /* maximum 10 minutes average value in 1 hour */
  ExtremunValueTypeDef ext_max;/* maximum instantaneous value in 1 hour */
  
  int16_t max_wd;      /* maximum 10 minutes average wind speed's wind direction in 1 hour */
  int16_t ext_max_wd;  /* maximum instantaneous wind speed's wind direction in 1 hour */
  
