Jianmufen/xiaoqihou2/程序/STM32Cube_FW_L1_V1.6.0/Projects/NMDT30_BOARD_MTH/Applications/FreeRTOS/FreeRTOS_ThreadCreation/Inc/sensor_def.h
} WindSpeedDataTypeDef;

/** 
  * @brief  Wind Direction Data Structure
  */  
typedef struct 
{
  int16_t wd_1s;     /* instantaneous wind direction : 1s sample value  */
  int16_t wd_1min;   /* 1 minute average wind direction */
  int16_t wd_2min;   /* 2 minute average wind direction */
  int16_t wd_10min;  /* 10 minute average wind direction */

  int16_t max;      /* maximum 10 minutes average wind speed's wind direction in 1 hour */
  int16_t ext_max;  /* maximum instantaneous wind speed's wind direction in 1 hour */
  
} WindDirectionDataTypeDef;

/** 
  * @brief  Rainfall Data Structure
  */  
typedef struct 
{
  int16_t rf_1min;           /* 1 minute accumulation rainfall */
  int16_t rf_1min_1h[60];    /* 60 1-minute rainfall in 1 hour */
  int16_t rf_1h;             /* 1 hour accumulation rainfall */
  
} RainfallDataTypeDef;

/** 
  * @brief  Carbon Dioxide Data Structure
  */  
typedef struct 
{
  int16_t co2_1min;   /* 1 minute sample CO2 */
  /* max and min */
  ExtremunValueTypeDef max;
  ExtremunValueTypeDef min;
  
} CarbonDioxideDataTypeDef;

/** 
  * @brief  Air Pressure Data Structure
  */  
typedef struct 
{
  int16_t ap_1min;   /* 1 minute average air pressure */
  /* max and min */
  ExtremunValueTypeDef max;
  ExtremunValueTypeDef min;
  
} AirPressureDataTypeDef;


/** 2017.4.5添加多个温湿光合测量，外扩3层温湿光合，使用3个zigbee无线终端将数据收集到协调器再连接到主采原来的气压串口来测量
  * @brief  MTH Data Structure
  */  
typedef struct
{
  
  struct MTHDataLayerTypeDef
  {
    TemperatureDataTypeDef Temp;   //温度数据，保留一位小数扩大10倍输出，如-289表示-28.9℃
    HumidityDataTypeDef    Hum;    //湿度数据，保留整数输出，如056表示56%RH
    RadiationDataTypeDef   RP;     //光合数据，保留整数输出，如1234表示1234ppm
  }L1,L2,L3;  //3层
  
} MTHDataTypeDef;


/** 
  * @brief  Output Measurement Data Structure
  */  
typedef struct 
{
  TemperatureDataTypeDef    *ta_1;   /* temperature air 1 */
  TemperatureDataTypeDef    *ta_2;   /* temperature air 2 */
  TemperatureDataTypeDef    *ta_3;   /* temperature air 3 */
  
  TemperatureDataTypeDef    *tg_1;   /* temperature ground 1 */
  TemperatureDataTypeDef    *tg_2;   /* temperature ground 2 */
  TemperatureDataTypeDef    *tg_3;   /* temperature ground 3 */
  TemperatureDataTypeDef    *tg_4;   /* temperature ground 4 */
  TemperatureDataTypeDef    *tg_5;   /* temperature ground 5 */
  
  HumidityDataTypeDef       *hum;    /* humidity */
  
  RadiationDataTypeDef      *rg;     /* global radiation */
  RadiationDataTypeDef      *rp;     /* PAR */
  
  SoilMoistureDataTypeDef   *sm_1;   /* soil moisture 1 */
  SoilMoistureDataTypeDef   *sm_2;   /* soil moisture 2 */
  SoilMoistureDataTypeDef   *sm_3;   /* soil moisture 3 */
  SoilMoistureDataTypeDef   *sm_4;   /* soil moisture 4 */
  SoilMoistureDataTypeDef   *sm_5;   /* soil moisture 5 */
  
  /* 1-minute reserved winds for output */
  WindSpeedDataTypeDef      *ws;     /* wind speed */
  WindDirectionDataTypeDef  *wd;     /* wind direction */
  /* current winds for display */
  WindSpeedDataTypeDef      *ws_current;     /* wind speed */
  WindDirectionDataTypeDef  *wd_current;     /* wind direction */
  
  RainfallDataTypeDef       *rf;     /* rainfall */
  
  CarbonDioxideDataTypeDef  *co2;    /* carbon dioxide */
  
  AirPressureDataTypeDef    *ap;     /* air pressure */
  
  /** 2017.4.5添加多个温湿光合测量，外扩3层温湿光合，使用3个zigbee无线终端将数据收集到协调器再连接到主采原来的气压串口来测量 */
  MTHDataTypeDef            *mth;
  
} OutputMeasurementDataTypeDef;


/* Raw Data */

/** 
  * @brief  Temperature Measurement Raw Data Structure
  */  
typedef struct 
{
  uint32_t R0_adc_value;    /* 100Ω standard resistance adc value */
  uint32_t RT_adc_value;    /* Temperature sensor adc value */
  
  float    RT_resistance;   /* Temperature sensor resistance */
  float    RawTemp;         /* Raw Temperature */
  
} TemperatureRawDataTypeDef;

/** 
  * @brief  Humidity Measurement Raw Data Structure
  */  
typedef struct 
{
  uint32_t HU_adc_value;    /* Humidity sensor adc value */
  
  float    voltage;         /* Humidity sensor voltage */
  float    RawHum;          /* Raw Humidity */
  
} HumidityRawDataTypeDef;

/** 
  * @brief  Radiation Measurement Raw Data Structure
  */  
typedef struct
{
  uint32_t RA_adc_value;    /* Radiation  adc value */
  
  float    voltage;         /* Radiation  voltage */
  float    RawRad;          /* Raw Radiation */
  
} RadiationRawDataTypeDef;

/** 
  * @brief  Soil Moisture Raw Data Structure
  */  
typedef struct
{
  uint32_t SM_adc_value;    /* SM  adc value */
  
  float    voltage;         /* SM  voltage */
  float    RawSM;           /* Raw Soil Moisture */
  
} SoilMoistureRawDataTypeDef;

/** 
  * @brief  Wind Speed Raw Data Structure
  */  
typedef struct
{
  uint32_t WS_frequence;      /* frequence */
  
  float    RawWS;             /* Raw Wind Speed */
  
} WindSpeedRawDataTypeDef;

/** 
  * @brief  Wind Direction Raw Data Structure
  */  
typedef struct
{
  uint8_t WD_gray;            /* gray code */
  
} WindDirectionRawDataTypeDef;

/** 
  * @brief  Rainfall Raw Data Structure
  */  
typedef struct
{
  uint16_t RF_count;            /* count */
  
} RainfallRawDataTypeDef;

/** 
  * @brief  Carbon Dioxide Raw Data Structure
  */  
typedef struct
{
  uint32_t CO2_adc_value;    /* CO2  adc value */
  
  float    voltage;         /* CO2  voltage */
  float    RawCO2;          /* Raw Carbon Dioxide */
  
} CarbonDioxideRawDataTypeDef;

/** 
  * @brief  Air Pressure Raw Data Structure
  */  
typedef struct
{
  uint8_t received;      /* received the digital barometer's data */
  
  float    RawAP;             /* Raw Air Pressure */
  
} AirPressureRawDataTypeDef;


/** 2017.4.5添加多个温湿光合测量，外扩3层温湿光合，使用3个zigbee无线终端将数据收集到协调器再连接到主采原来的气压串口来测量
  * @brief  MTH Raw Data Structure
  */  
typedef struct
{
  uint8_t received;      /* 接收到数据 */
  uint8_t parse_correct; /* 数据解析正确 */
  
  struct MTHRawDataLayerTypeDef
  {
    int16_t RawTemp;   //原始温度采样值，保留一位小数扩大10倍输出，如-289表示-28.9℃
    int16_t RawHum;    //原始湿度采样值，保留整数输出，如056表示56%RH
    int16_t RawRP;     //原始光合采样值，保留整数输出，如1234表示1234ppm
  }L1,L2,L3;  //3层
  
} MTHRawDataTypeDef;


/* Measurement Buffer */

/** 
  * @brief  Temperature Buffer Structure
  */  
typedef struct 
{
  /* buffer data */
  int16_t t_10sec;                      /* 10 second sample temperature value */
  int16_t t_10sec_1min[6];              /* 6 sample value in 1 minute */
  
} TemperatureBufferTypeDef;

/** 
  * @brief  Humidity Buffer Structure
  */  
typedef struct 
{
  /* buffer data */
  int16_t h_10sec;                      /* 10 second sample humidity value */
  int16_t h_10sec_1min[6];              /* 6 sample value in 1 minute */

} HumidityBufferTypeDef;


/** 
  * @brief  Radiation Buffer Structure
  */  
typedef struct 
{
  /* buffer data */
  int16_t r_10sec;                      /* 10 second sample radiation value */
  int16_t r_10sec_1min[6];              /* 6 sample value in 1 minute */

} RadiationBufferTypeDef;


/** 
  * @brief  Soil Moisture Buffer Structure
  */  
typedef struct 
{
  /* buffer data */
  int16_t sm_voltage_1min;              /* 1 minute sample soil moisture voltage */
  int16_t sm_voltage_1min_10min[10];    /* 10 sample voltage in 10 minutes */
  int16_t sm_voltage_10min_1hour[6];    /* 6 average voltage in 1 hour */
} SoilMoistureBufferTypeDef;
  
/** 
  * @brief  Wind Speed Buffer Structure
  */  
typedef struct 
{
  /* buffer data */
  int16_t ws_1s;                      /* 1 second sample value */
  int16_t ws_1s_3s[3];                /* 3 sample value in 3 seconds */
  
  int16_t ws_3s_1min[60];             /* 60 3s-average value in 1 minute */
  int16_t ws_3s_2min[120];            /* 120 3s-average value in 2 minutes */
  
  int16_t ws_1min_10min[10];          /* 10 1-minute-average value in 10 minutes */

