Jianmufen/xiaoqihou2/程序/STM32Cube_FW_L1_V1.6.0/Projects/NMDT30_BOARD_MTH/Applications/FreeRTOS/FreeRTOS_ThreadCreation/Inc/sensor_def.h
} WindSpeedBufferTypeDef;

/** 
  * @brief  Wind Direction Buffer Structure
  */  
typedef struct 
{
  /* buffer data */
  int16_t wd_1s_1min[60];             /* 60 1s-sample value in 1 minute */
  int16_t wd_1s_2min[120];            /* 120 1s-sample value in 2 minutes */
  
  int16_t wd_1min_10min[10];          /* 10 1-minute-average value in 10 minutes */

} WindDirectionBufferTypeDef;

/** 
  * @brief  Air Pressure Buffer Structure
  */  
typedef struct 
{
  /* buffer data */
  int16_t ap_10sec;                      /* 10 second sample  value */
  int16_t ap_10sec_1min[6];              /* 6 sample value in 1 minute */
  
} AirPressureBufferTypeDef;


/** 2017.4.5添加多个温湿光合测量，外扩3层温湿光合，使用3个zigbee无线终端将数据收集到协调器再连接到主采原来的气压串口来测量
  * @brief  MTH Raw Buffer Structure
  */  
typedef struct
{
  
  struct MTHBufferLayerTypeDef
  {
    int16_t t_10sec;     //10秒温度采样值，保留一位小数扩大10倍输出，如-289表示-28.9℃
    int16_t t_10sec_1min[6];              /* 1分钟内6个采样值 */
    
    int16_t h_10sec;     //10秒湿度采样值，保留整数输出，如056表示56%RH
    int16_t h_10sec_1min[6];              /* 1分钟内6个采样值 */
    
    int16_t rp_10sec;    //10秒光合采样值，保留整数输出，如1234表示1234ppm
    int16_t rp_10sec_1min[6];             /* 1分钟内6个采样值 */
  }L1,L2,L3;  //3层
  
} MTHBufferTypeDef;




/**
  * @}
  */

/* Measurement Data */

/** 
  * @brief  Temperature Measurement Structure
  */  
typedef struct 
{
  /* Raw Data */
  TemperatureRawDataTypeDef RawData;
  
  /* Buffer */
  TemperatureBufferTypeDef Buffer;
  
  /* Data */
  TemperatureDataTypeDef Temp;
  
  
  /* */
  /* Quality Control */
  //QualityControlTypeDef qc;
  
  /* Quadratic Correction Coefficient */
  //QuadraticCorrectionTypeDef cr;
  

  
  /* Correction Table */
  //CorrectionTableTypeDef ct;
  
} TemperatureMeasureTypeDef;

/** 
  * @brief  Temperatures Measurement Structure
  */  
typedef struct
{
  /* temperature air */
  TemperatureMeasureTypeDef ta_1;   /* temperature air 1 */
  TemperatureMeasureTypeDef ta_2;   /* temperature air 2 */
  TemperatureMeasureTypeDef ta_3;   /* temperature air 3 */
  
  /* temperature ground */
  TemperatureMeasureTypeDef tg_1;   /* temperature ground 1 */
  TemperatureMeasureTypeDef tg_2;   /* temperature ground 2 */
  TemperatureMeasureTypeDef tg_3;   /* temperature ground 3 */
  TemperatureMeasureTypeDef tg_4;   /* temperature ground 4 */
  TemperatureMeasureTypeDef tg_5;   /* temperature ground 5 */
  
} TemperaturesMeasureTypeDef;

/** 
  * @brief  Humidity Measurement Structure
  */  
typedef struct 
{
  /* Raw Data */
  HumidityRawDataTypeDef RawData;
  
  /* Buffer */
  HumidityBufferTypeDef Buffer;
  
  /* Data */
  HumidityDataTypeDef Hum;
  
  
  
  
  
  /* */
  /* Quality Control */
  //QualityControlTypeDef qc;
  
  /* Quadratic Correction Coefficient */
  //QuadraticCorrectionTypeDef cr;
  

  
  /* Correction Table */
  //CorrectionTableTypeDef ct;
  
} HumidityMeasureTypeDef;


/** 
  * @brief  Radiation Measurement Structure
  */  
typedef struct 
{
  /* Raw Data */
  RadiationRawDataTypeDef RawData;
  
  /* Buffer */
  RadiationBufferTypeDef Buffer;
  
  /* Data */
  RadiationDataTypeDef Rad;
  
  /* Radiation  Sensitivity Coefficient */
  RadiationCoefficientTypeDef Coefficient;
  
} RadiationMeasureTypeDef;

/** 
  * @brief  Radiations Measurement Structure
  */  
typedef struct
{
  /* global radiation */
  RadiationMeasureTypeDef RadG;
  
  /* photosynthetically active radiation（光合有效辐射） */
  RadiationMeasureTypeDef RadP;
  
} RadiationsMeasureTypeDef;

/** 
  * @brief  Soil Moisture Measurement Structure
  */  
typedef struct 
{
  /* Raw Data */
  SoilMoistureRawDataTypeDef RawData;
  
  /* Buffer */
  SoilMoistureBufferTypeDef Buffer;
  
  /* Data */
  SoilMoistureDataTypeDef SM;
  
  
} SoilMoistureMeasureTypeDef;

/** 
  * @brief  Soil Moistures Measurement Structure
  */  
typedef struct 
{
  /* 5 soil moisture sensor */
  SoilMoistureMeasureTypeDef sm_1;
  SoilMoistureMeasureTypeDef sm_2;
  SoilMoistureMeasureTypeDef sm_3;
  SoilMoistureMeasureTypeDef sm_4;
  SoilMoistureMeasureTypeDef sm_5;
  
  /* Soil Moisture Custom Calculate Table */
  
} SoilMoisturesMeasureTypeDef;

/** 
  * @brief  Wind Speed Measurement Structure
  */  
typedef struct 
{
  /* Raw Data */
  WindSpeedRawDataTypeDef RawData;
  
  /* Buffer */
  WindSpeedBufferTypeDef Buffer;
  
  /* Data */
  WindSpeedDataTypeDef WS;
  
  /* Data Backup */
  WindSpeedDataTypeDef WS_Back;  /* wind measures every 1 second so it need a backup data to output */
  
} WindSpeedMeasureTypeDef;

/** 
  * @brief  Wind Direction Measurement Structure
  */  
typedef struct 
{
  /* Raw Data */
  WindDirectionRawDataTypeDef RawData;
  
  /* Buffer */
  WindDirectionBufferTypeDef Buffer;
  
  /* Data */
  WindDirectionDataTypeDef WD;
  
  /* Data Backup */
  WindDirectionDataTypeDef WD_Back;  /* wind measures every 1 second so it need a backup data to output */
  
} WindDirectionMeasureTypeDef;

/** 
  * @brief  Winds Measurement Structure
  */  
typedef struct 
{
  /* wind speed */
  WindSpeedMeasureTypeDef ws;
  
  /* wind direction */
  WindDirectionMeasureTypeDef wd;
  
} WindsMeasureTypeDef;

/** 
  * @brief  Rainfall Measurement Structure
  */  
typedef struct 
{
  /* Raw Data */
  RainfallRawDataTypeDef RawData;
  
  /* Data */
  RainfallDataTypeDef RF;
  
} RainfallMeasureTypeDef;

/** 
  * @brief  Carbon Dioxide Measurement Structure
  */  
typedef struct 
{
  /* Raw Data */
  CarbonDioxideRawDataTypeDef RawData;
  
  /* Data */
  CarbonDioxideDataTypeDef CO2;
  
} CarbonDioxideMeasureTypeDef;

/** 
  * @brief  Air Pressure Measurement Structure
  */  
typedef struct 
{
  /* Raw Data */
  AirPressureRawDataTypeDef RawData;
  
  /* Buffer */
  AirPressureBufferTypeDef Buffer;
  
  /* Data */
  AirPressureDataTypeDef AP;
  
  
} AirPressureMeasureTypeDef;

/** 2017.4.5添加多个温湿光合测量，外扩3层温湿光合，使用3个zigbee无线终端将数据收集到协调器再连接到主采原来的气压串口来测量
  * @brief  MTH Measurement Structure
  */  
typedef struct
{
  /* 原始值 */
  MTHRawDataTypeDef RawData;
  
  /* 缓存 */
  MTHBufferTypeDef Buffer;
  
  /* 数据 */
  MTHDataTypeDef MTH;
  
} MTHMeasureTypeDef;


/**
  * @}
  */

/** 
  * @brief  Device State Information Structure
  */  
typedef struct 
{
  int16_t BoardVoltage;         /* Board Voltage */
  int16_t BoardTemp;            /* Board Temperature */
  
