Jianmufen/xiaoqihou2/程序/STM32Cube_FW_L1_V1.6.0/Projects/NMDT30_BOARD_MTH/Applications/FreeRTOS/FreeRTOS_ThreadCreation/Inc/sensor_def.h
  /* state value */
  uint8_t z;                    /* self-check state value : 0 - Normal ，1 - Abnormal */
  uint8_t v;                    /* Board Voltage State value : 0 - Normal，3 - Too High，4 - Too Low */
  uint8_t t;                    /* Board Temperature State value */  /* unused */
  uint8_t StateNumber;          /* output state value numbers */
} DeviceStateInfoTypeDef;



/**
  * @}
  */

/**
  * @}
  */

/** 
  * @brief sensor output data type structures definition  
  */  
typedef enum 
{
  DATA_1MINUTE           = 1,
  DATA_5MINUTE           = 5,
  DATA_1HOUR             = 160,
  DATA_1HOUR_REVERSE     = 240,   /* reversely download history data */
  DATA_INVALID           = 0xFF
} SENSOR_OutputDataTypeTypeDef;

/** 
  * @brief  Output Data Hearder Structure  ( 47 bytes )
  */  
typedef struct 
{
  uint8_t f_bg[3];    //帧起始标志固定为"BG,"，3字节
  uint8_t station_id[6];      /* Station ID */
  uint8_t station_type[3];    /* Station Type */
  uint8_t device_sign[5]; //设备标识
  uint8_t device_id[4];       /* Device ID */
  uint8_t data_time[15];      /* output data time */
  uint8_t frame_id[4];        /* Frame ID */
  uint8_t element_num[4];  //观测要素变量数
  uint8_t state_num[3];    //设备状态变量数
} OutputDataHearderTypeDef;

/** 
  * @brief  Output Data Tail Structure
  */ 
typedef struct 
{
  /* Including Device State Value , CheckSum and end info */
  uint8_t tail[64];
} OutputDataTailTypeDef;

/** 
  * @brief 1 minute Temperature Data Output Structure
  */ 
typedef struct 
{
  uint8_t t_1min[9];     /* 1minute Average  */
  uint8_t std_1min[10];  /* 1minute Standard deviation */
  
  uint8_t qc[3];         /* Quality control value */
} OutputDataTemp_1MinTypeDef;

/** 
  * @brief 1 minute Humidity Data Output Structure
  */ 
typedef struct 
{
  uint8_t h_1min[8];     /* 1minute Average  */
  uint8_t std_1min[10];  /* 1minute Standard deviation */
  
  uint8_t qc[3];         /* Quality control value */
} OutputDataHum_1MinTypeDef;

/** 
  * @brief 5 minute Temperature Data Output Structure
  */ 
typedef struct 
{
  uint8_t t_5min[11];     /* 5minute Average  */
  uint8_t std_5min[12];  /* 5minute Standard deviation */
  
  uint8_t qc[3];         /* Quality control value */
} OutputDataTemp_5MinTypeDef;

/**
  * @}
  */

/**
  * @}
  */

/**
  * first data record , 444 bytes
  */
typedef struct
{
  struct
  {
    uint8_t bg[2];                /* First Data Record Start Flag,fixed 2 bytes:"<C" */
    uint8_t station_id[5];            /* Station ID */
    uint8_t data_time[14];            /* output data date&time */
  } Header;
  
  /* sensor data field */
  /* Winds */
  uint8_t wd_1s[3];                 /* 1s sample wind direction */
  uint8_t ws1_3s[3];                /* 3s average wind speed 1 */
  uint8_t ws2_3s[3];                /* 3s average wind speed 2 */
  uint8_t wd_2min[3];               /* 2 minutes average wind didrection */
  uint8_t ws1_2min[3];              /* 2 minutes average wind speed 1 */
  uint8_t ws2_2min[3];              /* 2 minutes average wind speed 1 */
  uint8_t wd_10min[3];              /* 10 minutes average wind didrection */
  uint8_t ws1_10min[3];             /* 10 minutes average wind speed 1 */
  uint8_t ws2_10min[3];             /* 10 minutes average wind speed 1 */
  uint8_t wd1_ext_max[3];           /* maximum instantaneous wind speed 1's wind direction */
  uint8_t ws1_ext_max[3];           /* maximum instantaneous wind speed 1 */
  uint8_t ws1_ext_max_time[4];      /* maximum instantaneous wind speed 1 time */
  uint8_t wd2_ext_max[3];           /* maximum instantaneous wind speed 2's wind direction */
  uint8_t ws2_ext_max[3];           /* maximum instantaneous wind speed 2 */
  uint8_t ws2_ext_max_time[4];      /* maximum instantaneous wind speed 2 time */
  uint8_t wd1_max[3];               /* maximum wind speed 1's wind direction */
  uint8_t ws1_max[3];               /* maximum wind speed 1 */
  uint8_t ws1_max_time[4];          /* maximum wind speed 1 time */
  uint8_t wd2_max[3];               /* maximum wind speed 2's wind direction */
  uint8_t ws2_max[3];               /* maximum wind speed 2 */
  uint8_t ws2_max_time[4];          /* maximum wind speed 2 time */
  
  /* Temperature Airs */
  uint8_t ta1_1min[4];              /* 1 minute average temperature air 1 */
  uint8_t ta2_1min[4];              /* 1 minute average temperature air 2 */
  uint8_t ta1_max[4];               /* maximum temperature air 1 */
  uint8_t ta1_max_time[4];          /* maximum temperature air 1 time */
  uint8_t ta2_max[4];               /* maximum temperature air 2 */
  uint8_t ta2_max_time[4];          /* maximum temperature air 2 time */
  uint8_t ta1_min[4];               /* minimum temperature air 1 */
  uint8_t ta1_min_time[4];          /* minimum temperature air 1 time */
  uint8_t ta2_min[4];               /* minimum temperature air 2 */
  uint8_t ta2_min_time[4];          /* minimum temperature air 2 time */
  
  /* Humidity */
  uint8_t hum1_1min[3];             /* 1 minute average humidity 1 */
  uint8_t hum2_1min[3];             /* 1 minute average humidity 2 */
  uint8_t hum1_min[3];              /* minimum humidity 1 */
  uint8_t hum1_min_time[4];         /* minimum humidity 1 time */
  uint8_t hum2_min[3];              /* minimum humidity 2 */
  uint8_t hum2_min_time[4];         /* minimum humidity 2 time */
  
  /* Rainfall */
  uint8_t rf_1min[60][2];           /* 60 1-minute rainfall in 1 hour,2 bytes for each */
  
  /* Radiations */
  /* RG */
  uint8_t rg_1min[4];               /* 1 minute average global radiation */
  uint8_t rg_max[4];                /* maximum global radiation */
  uint8_t rg_max_time[4];           /* maximum global radiation time */
  uint8_t rg_sum_hour[4];           /* Accumulated duration of radiation in 1 hour */
  uint8_t rg_sum_day[4];            /* Accumulated duration of radiation in 1 day */
  /* RP */
  uint8_t rp_1min[4];               /* 1 minute average PAR */
  uint8_t rp_max[4];                /* maximum PAR */
  uint8_t rp_max_time[4];           /* maximum PAR time */
  uint8_t rp_sum_hour[6];           /* Accumulated duration of PAR radiation in 1 hour */
  uint8_t rp_sum_day[6];            /* Accumulated duration of PAR radiation in 1 day */
  
  /* Temperature Grounds and CO2 */
  /* tg_4 */
  uint8_t tg4_1min[4];              /* 1 minute average temperature ground 4 */
  uint8_t tg4_max[4];               /* maximum temperature ground 4 */
  uint8_t tg4_max_time[4];          /* maximum temperature ground 4 time */
  uint8_t tg4_min[4];               /* minimum temperature ground 4  */
  uint8_t tg4_min_time[4];          /* minimum temperature ground 4  time */
  /* tg_5 */
  uint8_t tg5_1min[4];              /* 1 minute average temperature ground 5 */
  uint8_t tg5_max[4];               /* maximum temperature ground 5 */
  uint8_t tg5_max_time[4];          /* maximum temperature ground 5 time */
  uint8_t tg5_min[4];               /* minimum temperature ground 5  */
  uint8_t tg5_min_time[4];          /* minimum temperature ground 5  time */
  /* CO2 */
  uint8_t co2_1min[4];              /* 1 minute sample co2 */
  uint8_t co2_max[4];               /* maximum co2 */
  uint8_t co2_max_time[4];          /* maximum co2 time */
  uint8_t co2_min[4];               /* minimum co2 */
  uint8_t co2_min_time[4];          /* minimum co2 time */
  /* tg_1 */
  uint8_t tg1_1min[4];              /* 1 minute average temperature ground 1 */
  uint8_t tg1_max[4];               /* maximum temperature ground 1 */
  uint8_t tg1_max_time[4];          /* maximum temperature ground 1 time */
  uint8_t tg1_min[4];               /* minimum temperature ground 1  */
  uint8_t tg1_min_time[4];          /* minimum temperature ground 1  time */
  /* tg_2 */
  uint8_t tg2_1min[4];              /* 1 minute average temperature ground 2 */
  /* tg_3 */
  uint8_t tg3_1min[4];              /* 1 minute average temperature ground 3 */
  
