Jianmufen/xiaoqihou2/程序/STM32Cube_FW_L1_V1.6.0/Projects/NMDT30_BOARD_MTH/Applications/FreeRTOS/FreeRTOS_ThreadCreation/Inc/sensor_def.h
  /* Soil Moistures(voltage) */
  /* 10 minutes */
  uint8_t sm1_voltage_10min[4];     /* 10 minutes average sm 1 voltage */
  uint8_t sm2_voltage_10min[4];     /* 10 minutes average sm 2 voltage */
  uint8_t sm3_voltage_10min[4];     /* 10 minutes average sm 3 voltage */
  uint8_t sm4_voltage_10min[4];     /* 10 minutes average sm 4 voltage */
  uint8_t sm5_voltage_10min[4];     /* 10 minutes average sm 5 voltage */
  /* 1 hour */
  uint8_t sm1_voltage_1hour[4];     /* 1 hour average sm 1 voltage */
  uint8_t sm2_voltage_1hour[4];     /* 1 hour average sm 2 voltage */
  uint8_t sm3_voltage_1hour[4];     /* 1 hour average sm 3 voltage */
  uint8_t sm4_voltage_1hour[4];     /* 1 hour average sm 4 voltage */
  uint8_t sm5_voltage_1hour[4];     /* 1 hour average sm 5 voltage */
  
  /* Power voltage VDD */
  uint8_t power_voltage[3];         /* power voltage */
  
  
  uint8_t ed;                  /* First Data Record End Flag,fixed 1 byte:">" */
  
} OutputDataFirstRecondTypeDef;
  
  
/**
  * second data record , 71 bytes
  */
typedef struct
{
  struct
  {
    uint8_t bg[2];                /* Second Data Record Start Flag,fixed 2 bytes:"<D" */
  } Header;
  
  /* sensor data field */
  /* Temperature Airs */
  /* ta_3 */
  uint8_t ta3_1min[4];              /* 1 minute average temperature air 3 */
  uint8_t ta3_max[4];               /* maximum temperature air 3 */
  uint8_t ta3_max_time[4];          /* maximum temperature air 3 time */
  uint8_t ta3_min[4];               /* minimum temperature air 3 */
  uint8_t ta3_min_time[4];          /* minimum temperature air 3 time */
  
  /* Air Pressure */
  uint8_t ap_1min[5];              /* 1 minute average air pressure */
  uint8_t ap_max[5];               /* maximum air pressure */
  uint8_t ap_max_time[4];          /* maximum air pressure */
  uint8_t ap_min[5];               /* minimum air pressure */
  uint8_t ap_min_time[4];          /* minimum air pressure */
  
  /* reserved */
  uint8_t reserved[25];
  
//  /* ta_4 */   //16.1.21 removed and add air pressure instead
//  uint8_t ta4_1min[4];              /* 1 minute average temperature air 4 */
//  uint8_t ta4_max[4];               /* maximum temperature air 4 */
//  uint8_t ta4_max_time[4];          /* maximum temperature air 4 time */
//  uint8_t ta4_min[4];               /* minimum temperature air 4 */
//  uint8_t ta4_min_time[4];          /* minimum temperature air 4 time */
//  /* ta_5 */
//  uint8_t ta5_1min[4];              /* 1 minute average temperature air 5 */
//  uint8_t ta5_max[4];               /* maximum temperature air 5 */
//  uint8_t ta5_max_time[4];          /* maximum temperature air 5 time */
//  uint8_t ta5_min[4];               /* minimum temperature air 5 */
//  uint8_t ta5_min_time[4];          /* minimum temperature air 5 time */
//  
//  /* Temperature Grounds */
//  /* tg_6 */
//  uint8_t tg6_1min[4];              /* 1 minute average temperature ground 6 */
//  /* tg_3 */
//  uint8_t tg7_1min[4];              /* 1 minute average temperature ground 7 */
  
  
  
  
  uint8_t ed;                   /* Second Data Record End Flag,fixed 1 byte:">" */
  

} OutputDataSecondTypeDef;


/** 2017.4.5添加多个温湿光合测量，外扩3层温湿光合，使用3个zigbee无线终端将数据收集到协调器再连接到主采原来的气压串口来测量 */
//添加第三串数据用来传输新扩展的要素数据，共384字节，未用到的保留备用
/**
  * third data record , 384 bytes
  */
typedef struct
{
  struct
  {
    uint8_t bg[2];                /* 数据开始符,固定 2 字节:"<D" */
  } Header;
  
  /* 传感器数据域 */
  /* 温度 */
  //L1
  uint8_t L1_ta_1min[4];               /* 1分钟平均值 */
  uint8_t L1_ta_max[4];               /* 小时内最大值 */
  uint8_t L1_ta_max_time[4];          /* 最大时间 */
  uint8_t L1_ta_min[4];               /* 小时内最小值 */
  uint8_t L1_ta_min_time[4];          /* 最小时间 */
  //L2
  uint8_t L2_ta_1min[4];               /* 1分钟平均值 */
  uint8_t L2_ta_max[4];               /* 小时内最大值 */
  uint8_t L2_ta_max_time[4];          /* 最大时间 */
  uint8_t L2_ta_min[4];               /* 小时内最小值 */
  uint8_t L2_ta_min_time[4];          /* 最小时间 */
  //L3
  uint8_t L3_ta_1min[4];               /* 1分钟平均值 */
  uint8_t L3_ta_max[4];               /* 小时内最大值 */
  uint8_t L3_ta_max_time[4];          /* 最大时间 */
  uint8_t L3_ta_min[4];               /* 小时内最小值 */
  uint8_t L3_ta_min_time[4];          /* 最小时间 */
  
  /* 湿度 */
  //L1
  uint8_t L1_hum_1min[3];              /* 1分钟平均值 */
  uint8_t L1_hum_min[3];               /* 小时内最小值 */
  uint8_t L1_hum_min_time[4];          /* 最小时间 */
  //L2
  uint8_t L2_hum_1min[3];              /* 1分钟平均值 */
  uint8_t L2_hum_min[3];               /* 小时内最小值 */
  uint8_t L2_hum_min_time[4];          /* 最小时间 */
  //L3
  uint8_t L3_hum_1min[3];              /* 1分钟平均值 */
  uint8_t L3_hum_min[3];               /* 小时内最小值 */
  uint8_t L3_hum_min_time[4];          /* 最小时间 */
  
  
  /* 光合 */
  //L1
  uint8_t L1_rp_1min[4];               /* 1分钟平均值 */
  uint8_t L1_rp_max[4];                /* 小时内最大值 */
  uint8_t L1_rp_max_time[4];           /* 最大时间 */
  uint8_t L1_rp_sum_hour[6];           /* 小时曝辐量 */
  uint8_t L1_rp_sum_day[6];            /* 日曝辐量 */
  //L2
  uint8_t L2_rp_1min[4];               /* 1分钟平均值 */
  uint8_t L2_rp_max[4];                /* 小时内最大值 */
  uint8_t L2_rp_max_time[4];           /* 最大时间 */
  uint8_t L2_rp_sum_hour[6];           /* 小时曝辐量 */
  uint8_t L2_rp_sum_day[6];            /* 日曝辐量 */
  //L3
  uint8_t L3_rp_1min[4];               /* 1分钟平均值 */
  uint8_t L3_rp_max[4];                /* 小时内最大值 */
  uint8_t L3_rp_max_time[4];           /* 最大时间 */
  uint8_t L3_rp_sum_hour[6];           /* 小时曝辐量 */
  uint8_t L3_rp_sum_day[6];            /* 日曝辐量 */
  
  
  
  /* 保留 */
  uint8_t reserved[219];
  

  
  
  
  
  uint8_t ed;                   /* 数据结束符，固定 1 字节:">" */
  

} OutputDataThirdTypeDef;


/** 
  * @brief  Output Data Structure 
  */ 
typedef struct
{
  /* First Data Record */
  OutputDataFirstRecondTypeDef    FirstRecord;
  
  /* Second Data Record */
  OutputDataSecondTypeDef         SecondRecord;
  
  /** 2017.4.5添加多个温湿光合测量，外扩3层温湿光合，使用3个zigbee无线终端将数据收集到协调器再连接到主采原来的气压串口来测量 */
  /* 第三串数据 */
  OutputDataThirdTypeDef          ThirdRecord;
  
  /**
    * data frame end
    */ 
  uint8_t ed_frame[2];              /* Frame End Flag,fixed 1 byte:"}" ,following with '\0' */
} OutputDataTypeDef;
  

/**
  * @}
  */

/**
  * @}
  */


/** 
  * @brief  SENSOR Serial Number Definition 
  */ 
typedef struct
{
  uint16_t StorageFlag;    /* flag that indicates if the data has been stored in NV storage */
  
  uint8_t factory_number[2];     /* factory number */
  uint8_t reserved[3];           /* reserved */
  uint8_t custom[11];            /* user custom */
} SensorSNTypeDef;


/* Sensor Configuration Parameters */
/** 
  * @brief Sensor Serial Communication Parameter structure
  */ 
typedef struct
{
  uint16_t StorageFlag;    /* flag that indicates if the data has been stored in NV storage */
  uint32_t BaudRate;       /* Serial Baudrate */
} SerialComParamTypeDef;

/** 
  * @brief Sensor data autosend structure
  */ 
typedef struct
{
  uint16_t StorageFlag;    /* flag that indicates if the data has been stored in NV storage */
  uint16_t enable;
} DataAutoSendTypeDef;

/** 
* @brief Sensor data output way:0-wireless,1-serial1,2-serial2...
  */ 
typedef struct
{
  uint16_t StorageFlag;    /* flag that indicates if the data has been stored in NV storage */
  uint16_t way;
} DataOutputWayTypeDef;

/** 
* @brief Sensor data output delay,unit : ms
  */ 
typedef struct
{
  uint16_t StorageFlag;    /* flag that indicates if the data has been stored in NV storage */
  uint32_t delay;
} DataOutputDelayTypeDef;

/** 
* @brief sample data output structure
  */ 
typedef struct
{
  uint8_t number;    /* sensor number,1-5 */
  uint8_t enable;    /* sample output enable */
} SampleDataOutputTypeDef;

/** 
* @brief simulate measurement structure
  */ 
typedef struct
{
  uint8_t number;           /* sensor number,1-5 */
  uint8_t enable;           /* sample output enable */
  uint8_t as_rawdata;       /* input value is regarded as measured raw data */
  int32_t simulate_value;   /* the input simulate value */
} SimulateDataTypeDef;

/** 
  * @brief Sensor configuration parameters structure
  */ 
typedef struct
{
  SensorSNTypeDef SN;             /* Sensor Serial Number */
  
