Jianmufen/xiaoqihou2/程序/STM32Cube_FW_L1_V1.6.0/Projects/NMDT30_BOARD_MTH/Applications/FreeRTOS/FreeRTOS_ThreadCreation/Inc/sensor_def.h
  DataAutoSendTypeDef      sw;    /* data autosend config */
  DataOutputWayTypeDef     mo;    /* data output way */
  DataOutputDelayTypeDef   ft;    /* data output delay */
  StdevTimeIntervalTypeDef de;    /* Standard deviation calculate time interval */
  
  DataOutputTimeIntervalTypeDef ot;    //data output time interval,unit : minute,0-60,0 stands for polling 
  
  uint8_t  encryption_code;       /* 1-byte encryption code */
  uint8_t  output_rawdata;        /* raw measurement data output config */
  uint8_t  debug;                 /* debug infomation output config */
  
  SampleDataOutputTypeDef  cy;    /* sample data output config */
  SimulateDataTypeDef      mn;    /* simulate data config */
  
} SensorConfigTypeDef;

/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/   

/**
  * @}
  */

/**
  * @}
  */

/** 
  * @brief  Quality control value
  */
#define QC_STORED           (0xCDA5)  /* Stored Flag */
#define QC_VALID_RATIO      (2.0/3)   /* Minimum Valid Samples Ratio */
#define QC_R   0  //正确
#define QC_D   1  //存疑
#define QC_E   2  //错误
#define QC_L   8  //缺测
#define QC_Correct        0        /*  Correct value */
#define QC_Questionable   1        /*  Questionable value */
#define QC_Error          2        /*  Error value */
#define QC_Missing        8        /*  Missing value */
 
/* default QC Parameter */
#if (SENSOR_ID==S_TEMP)    /* Temperature */
#define DEFAULT_QC_LL    (-9000)   /* low limit */
#define DEFAULT_QC_UL    (9000)    /* upper limit */
#define DEFAULT_QC_MCR   (200)     /* max change rate */
#elif (SENSOR_ID==S_HUM)    /* Humidity */
#define DEFAULT_QC_LL    (0)   /* low limit */
#define DEFAULT_QC_UL    (100)    /* upper limit */
#define DEFAULT_QC_MCR   (10)     /* max change rate */
#else
    
#endif   /* SENSOR_ID */
    
    
/** 
  * @brief  Quadratic Correction value
  */
#define CR_STORED           (0xABCD)  /* Stored Flag */
/* default CR Parameter */
#define DEFAULT_CR_A    (0)
#define DEFAULT_CR_B    (0)
#define DEFAULT_CR_C    (0)


/** 
  * @brief  Radiation  Sensitivity Coefficient
  */
#define RC_STORED           (0x2468)   /* Stored Flag */
#define DEFAULT_RCG_COEFFICIENT  (11.73)
#define DEFAULT_RCP_COEFFICIENT  (4.73)


/** 
  * @brief  Sensor Configuration Parameters
  */
#define SC_STORED           (0x1357)   /* Stored Flag */
    
/** 
  * @brief   Serial Communication Parameters 
  */
/* default SE Parameter */
#define DEFAULT_SE_BAUDRATE    (19200)


/** 
  * @brief  Correction Table value
  */
#define CT_STORED           (0x2468)   /* Stored Flag */



/**
  * @}
  */

/**
  * @}
  */






/**
  * @}
  */

/**
  * @}
  */


/* -----------------------------------------------------------------------------
 *                               Macros
 * -----------------------------------------------------------------------------
 */

#ifndef BV
#define BV(n)      (1 << (n))
#endif

#ifndef BF
#define BF(x,b,s)  (((x) & (b)) >> (s))
#endif

#ifndef MIN
#define MIN(n,m)   (((n) < (m)) ? (n) : (m))
#endif

#ifndef MAX
#define MAX(n,m)   (((n) < (m)) ? (m) : (n))
#endif

#ifndef ABS
#define ABS(n)     (((n) < 0) ? -(n) : (n))
#endif


/* takes a byte out of a uint32 : var - uint32,  ByteNum - byte to take out (0 - 3) */
#define BREAK_UINT32( var, ByteNum ) \
          (uint8)((uint32)(((var) >>((ByteNum) * 8)) & 0x00FF))

#define BUILD_UINT32(Byte0, Byte1, Byte2, Byte3) \
          ((uint32)((uint32)((Byte0) & 0x00FF) \
          + ((uint32)((Byte1) & 0x00FF) << 8) \
          + ((uint32)((Byte2) & 0x00FF) << 16) \
          + ((uint32)((Byte3) & 0x00FF) << 24)))

#define BUILD_UINT16(loByte, hiByte) \
          ((uint16)(((loByte) & 0x00FF) + (((hiByte) & 0x00FF) << 8)))

#define HI_UINT16(a) (((a) >> 8) & 0xFF)
#define LO_UINT16(a) ((a) & 0xFF)

#define BUILD_UINT8(hiByte, loByte) \
          ((uint8)(((loByte) & 0x0F) + (((hiByte) & 0x0F) << 4)))

#define HI_UINT8(a) (((a) >> 4) & 0x0F)
#define LO_UINT8(a) ((a) & 0x0F)

/*
 *  This macro is for use by other macros to form a fully valid C statement.
 *  Without this, the if/else conditionals could show unexpected behavior.
 *
 *  For example, use...
 *    #define SET_REGS()  st( ioreg1 = 0; ioreg2 = 0; )
 *  instead of ...
 *    #define SET_REGS()  { ioreg1 = 0; ioreg2 = 0; }
 *  or
 *    #define  SET_REGS()    ioreg1 = 0; ioreg2 = 0;
 *  The last macro would not behave as expected in the if/else construct.
 *  The second to last macro will cause a compiler error in certain uses
 *  of if/else construct
 *
 *  It is not necessary, or recommended, to use this macro where there is
 *  already a valid C statement.  For example, the following is redundant...
 *    #define CALL_FUNC()   st(  func();  )
 *  This should simply be...
 *    #define CALL_FUNC()   func()
 *
 * (The while condition below evaluates false without generating a
 *  constant-controlling-loop type of warning on most compilers.)
 */
#define st(x)      do { x } while (__LINE__ == -1)
   
   
/* length of array */
#define LENGTH_OF(x)   (sizeof(x)/sizeof(*(x)))
/* Exported constants --------------------------------------------------------*/





#ifdef __cplusplus
}
#endif
#endif /*__SENSOR_DEF_H */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
